{
  "products": [
    {
      "name": "Điện thoại iPhone 12 64GB",
      "image": "https://res.cloudinary.com/ductham087/image/upload/v1659980695/12_64G_lotl7b.png",
      "price": "12000000",
      "price_sale": "10000000",
      "categoryId": 1,
      "desc_sort": "Trong những tháng cuối năm 2020, Apple đã chính thức giới thiệu đến người dùng cũng như iFan thế hệ iPhone 12 series mới với hàng loạt tính năng bứt phá, thiết kế được lột xác hoàn toàn, hiệu năng đầy mạnh mẽ và một trong số đó chính là iPhone 12 64GB.",
      "desc_products": "Hiệu năng vượt xa mọi giới hạn. Apple đã trang bị con chip mới nhất của hãng (tính đến 11/2020) cho iPhone 12 đó là A14 Bionic, được sản xuất trên tiến trình 5 nm với hiệu suất ổn định hơn so với chip A13 được trang bị trên phiên bản tiền nhiệm iPhone 11.Với CPU Apple A14 Bionic, bạn có thể dễ dàng trải nghiệm mọi tựa game với những pha chuyển cảnh mượt mà hay hàng loạt hiệu ứng đồ họa tuyệt đẹp ở mức đồ họa cao mà không lo tình trạng giật lag.Chưa hết, Apple còn gây bất ngờ đến người dùng với hệ thống 5G lần đầu tiên được trang bị trên những chiếc iPhone, cho tốc độ truyền tải dữ liệu nhanh hơn, ổn định hơn. iPhone 12 sẽ chạy trên hệ điều hành iOS 15 (12/2021) với nhiều tính năng hấp dẫn như hỗ trợ Widget cũng như những nâng cấp tối ưu phần mềm đáng kể mang lại những trải nghiệm thú vị mới lạ đến người dùng.Cụm camera không ngừng cải tiến. iPhone 12 được trang bị hệ thống camera kép bao gồm camera góc rộng và camera siêu rộng có cùng độ phân giải là 12 MP, chế độ ban đêm (Night Mode) trên bộ đôi camera này cũng đã được nâng cấp về phần cứng lẫn thuật toán xử lý, khi chụp những bức ảnh thiếu sáng bạn sẽ nhận được kết quả ấn tượng với màu sắc, độ chi tiết rõ nét đáng kinh ngạc. Bạn có thể khám phá thêm những tính năng của camera trên iPhone 12 như chế độ smart HDR 3 giúp cân bằng yếu tố ánh sáng trong ảnh, làm nổi bật chi tiết đối tượng và cây cối trong khi vẫn giữ được màu sắc phong phú của bầu trời ngay cả vào buổi trưa nắng gắt.            ",
      "feature": "iPhone 12 được trang bị hệ thống camera kép bao gồm camera góc rộng và camera siêu rộng có cùng độ phân giải là 12 MP, chế độ ban đêm (Night Mode) trên bộ đôi camera này cũng đã được nâng cấp về phần cứng lẫn thuật toán xử lý, khi chụp những bức ảnh thiếu sáng bạn sẽ nhận được kết quả ấn tượng với màu sắc, độ chi tiết rõ nét đáng kinh ngạc.Bạn có thể khám phá thêm những tính năng của camera trên iPhone 12 như chế độ smart HDR 3 giúp cân bằng yếu tố ánh sáng trong ảnh, làm nổi bật chi tiết đối tượng và cây cối trong khi vẫn giữ được màu sắc phong phú của bầu trời ngay cả vào buổi trưa nắng gắt.",
      "id": 1
    },
    {
      "name": "Samsung Galaxy S22 5G (8GB 256GB) Chính hãng",
      "image": "https://res.cloudinary.com/ductham087/image/upload/v1659982068/samsung-galaxy-s22-5g-256gb-ram-8gb-01644461541-2-scaled_xyojzf.jpg",
      "price": "23900000",
      "price_sale": "17350000",
      "categoryId": 1,
      "desc_sort": "Samsung Galaxy S22 ra mắt với diện mạo vô cùng tinh tế và trẻ trung, mang trong mình thiết kế phẳng theo xu hướng thịnh hành, màn hình 120 Hz mượt mà, cụm camera AI 50 MP và bộ xử lý đến từ Qualcomm.",
      "desc_products": "Đột phá mới nhất nâng tầm nhiếp ảnh di động. Cảm biến thu được nhiều ánh sáng hơn, Lớp kính siêu trong hạn chế ánh sáng lóa và AI hoạt động nhanh mang đến khả năng xử lý thông minh gần như tức thì. Ánh mặt trời đã gặp đối thủ xứng tầm. Gặp gỡ màn hình sáng nhất Samsung Galaxy. Với công nghệ Dynamic AMOLED 2X và Vision Booster, màn hình tràn Galaxy S22 hiển thị mọi nội dung ở chất lượng tốt nhất, bất chấp nắng chói. Bước nhảy vọt cho công nghệ di động. Vi xử lý nhanh nhất, mạnh nhất từ trước đến nay với CPU và GPU nhanh hơn so với Galaxy S21 Ultra. Hiệu chỉnh OIS cải thiện cảnh quay 58% ới khả năng lấy mẫu chuyển động nhanh hơn cho mỗi chuyển động đều ổn định. Công nghệ Super HDR hiệu chỉnh màu sắc trên từng khung hình cho mỗi cảnh quay thêm mãn nhãn. Tụ họp bàn bè online với Google Duo * để cùng xem phim ** - phát trực tuyến video chất lượng cao theo thời gian thực và chia sẻ nhiều điều hơn nữa. Pin thích ứng một cách thông minh với cách bạn sử dụng điện thoại cho thời lượng pin kéo dài hơn 24 giờ.",
      "feature": "Khắc đêm thêm diệu kỳ với Mắt Thần Bóng Đêm: Đột phá mới nhất nâng tầm nhiếp ảnh di động. Cảm biến thu được nhiều ánh sáng hơn, Lớp kính siêu trong hạn chế ánh sáng lóa và AI hoạt động nhanh mang đến khả năng xử lý thông minh gần như tức thì. VisionBooster cho màn hình sáng rõ bất chấp nắng chói: Ánh mặt trời đã gặp đối thủ xứng tầm. Gặp gỡ màn hình sáng nhất Samsung Galaxy. Với công nghệ Dynamic AMOLED 2X và Vision Booster, màn hình tràn Galaxy S22 hiển thị mọi nội dung ở chất lượng tốt nhất, bất chấp nắng chói.",
      "id": 2
    },
    {
      "name": "Điện thoại iPhone 11 64GB ",
      "image": "https://res.cloudinary.com/ductham087/image/upload/v1659982661/f7651bda-0818-4111-a0e7-866e39216285_wslf6l.webp",
      "price": "1500000",
      "price_sale": "1300000",
      "categoryId": 1,
      "desc_sort": "Apple đã chính thức trình làng bộ 3 siêu phẩm iPhone 11, trong đó phiên bản iPhone 11 64GB có mức giá rẻ nhất nhưng vẫn được nâng cấp mạnh mẽ như iPhone Xr ra mắt trước đó.",
      "desc_products": "Nâng cấp mạnh mẽ về camera: Nói về nâng cấp thì camera chính là điểm có nhiều cải tiến nhất trên thế hệ iPhone mới.Nếu như trước đây iPhone Xr chỉ có một camera thì nay với iPhone 11 chúng ta sẽ có tới hai camera ở mặt sau.Ngoài camera chính vẫn có độ phân giải 12 MP thì chúng ta sẽ có thêm một camera góc siêu rộng và cũng với độ phân giải tương tự.Theo Apple thì việc chuyển đổi qua lại giữa hai ống kính thì sẽ không làm thay đổi màu sắc của bức ảnh.Đây là một điều được xem là bước ngoặt bởi những chiếc smartphone Android có nhiều camera hiện nay sẽ thường bị sai lệch về màu sắc khi chuyển đổi qua lại giữa các ống kính gây cảm giác khá khó chịu cho người dùng.Bên cạnh đó với iPhone 11 thì đây sẽ là lần đầu tiên Apple trang bị khả năng chụp đêm lên chiếc iPhone của mình.Theo trải nghiệm thì tính năng này hoạt động rất hiệu quả đặc biệt trong những môi trường cực kỳ thiếu sáng.Kích hoạt chế độ chụp đêm sẽ do iPhone tự quyết định việc của bạn chỉ cần đưa máy lên và chụp, rất đơn giản.Năm nay Apple cũng đã nâng cấp độ phân giải camera trước nên 12 MP thay vì 7 MP như thế hệ trước đó. Camera trước cũng có một tính năng thông minh, khi bạn xoay ngang điện thoại nó sẽ tự kích hoạt chế độ selfie góc rộng để bạn có thể chụp với nhiều người hơn.                ",
      "feature": "Nâng cấp mạnh mẽ về camera: Nói về nâng cấp thì camera chính là điểm có nhiều cải tiến nhất trên thế hệ iPhone mới.Nếu như trước đây iPhone Xr chỉ có một camera thì nay với iPhone 11 chúng ta sẽ có tới hai camera ở mặt sau.Ngoài camera chính vẫn có độ phân giải 12 MP thì chúng ta sẽ có thêm một camera góc siêu rộng và cũng với độ phân giải tương tự.",
      "id": 3
    },
    {
      "name": "Điện thoại iPhone SE 128GB (2022)",
      "image": "https://res.cloudinary.com/ductham087/image/upload/v1659983276/iphone-se-white-select-2020.htm_1586982089_vf2r3x.png",
      "price": 1500000,
      "price_sale": 1300000,
      "categoryId": 1,
      "desc_sort": "Được Apple cho ra mắt vào 8/3, iPhone SE 128GB (2022) có nhiều điểm được nâng cấp và ở phiên bản 128 GB này thì khả năng lưu trữ của máy cũng sẽ được nâng cao hơn nhiều so với phiên bản iPhone SE 64G (2022). Ngoài điểm này cùng mình xem thử chiếc iPhone SE 128GB (2022) có điểm gì đáng tiền nữa nhé.",
      "desc_products": "Được trang bị con chip Apple A15 Bionic mới nhất cho điện thoại mang đến một hiệu năng mạnh mẽ. Nó sẽ có thể xử lý mọi tác vụ bất kể là nặng hay nhẹ một cách mượt mà. Mang trên mình camera sau 12 MP và camera trước 7 MP có lẽ nhiều người sẽ cho rằng nó khá khiêm tốn khi hầu hết các điện thoại thời nay đều có độ phân giải camera chính khá cao. Nhưng bạn đừng quá lo lắng, thuật toán chụp ảnh trên iPhone rất tuyệt vời, nó sẽ cho bạn những tấm ảnh tuyệt vời nhất. Được nâng cấp đáng kể thời lượng pin từ thế hệ tiền nhiệm khi bạn có thể xem phim liên tục 15 tiếng đồng hồ và có cả sạc nhanh 20 W giúp bạn có thể rút ngắn thời gian sạc.Theo mình thấy, vì đây chỉ là một chiếc điện thoại được cho là nằm ở phân khúc tầm trung của nhà Apple nhưng vẫn được trang bị khá nhiều công nghệ hiện đại, mang đến cho bạn một trải nghiệm mượt mà, ấn tượng.",
      "feature": "Được trang bị con chip Apple A15 Bionic mới nhất cho điện thoại mang đến một hiệu năng mạnh mẽ. Nó sẽ có thể xử lý mọi tác vụ bất kể là nặng hay nhẹ một cách mượt mà. Mang trên mình camera sau 12 MP và camera trước 7 MP có lẽ nhiều người sẽ cho rằng nó khá khiêm tốn khi hầu hết các điện thoại thời nay đều có độ phân giải camera chính khá cao",
      "id": 4
    },
    {
      "name": "Điện thoại Samsung Galaxy S22 5G 128GB ",
      "image": "https://res.cloudinary.com/ductham087/image/upload/v1659983211/samsung-galaxy-s22-green_gzg2rx.jpg",
      "price": 1500000,
      "price_sale": 1300000,
      "categoryId": 1,
      "desc_sort": "Samsung Galaxy S22 ra mắt với diện mạo vô cùng tinh tế và trẻ trung, mang trong mình thiết kế phẳng theo xu hướng thịnh hành, màn hình 120 Hz mượt mà, cụm camera AI 50 MP và bộ xử lý đến từ Qualcomm.",
      "desc_products": "Cảm giác đầu tiên Samsung Galaxy S22 mang lại cho mình khi sử dụng là máy cho cảm giác cầm nắm cực kỳ chắc chắn và đằm tay với thiết kế nhỏ gọn của mình. Đây là một chiếc điện thoại vô cùng bền bỉ khi khung viền được cấu thành từ Armor Aluminum cứng cáp, được trang bị kính cường lực Corning Gorilla Glass Victus+ đầu tiên trên thị trường. Mặt lưng cũng được hoàn thiện từ kính với thiết kế phẳng, viền màn hình của Galaxy S22 được làm mỏng ở cả 4 cạnh trông rất cân đối và gọn gàng. Tất cả những điều trên tạo nên một cảm giác cầm nắm, sử dụng rất tốt. Cụm camera phía sau có lồi hơn mặt lưng một chút, có màu sắc tương đồng với màu sản phẩm tương tự với dòng Galaxy S21 đã ra mắt trước đó. Nhìn chung phần thiết kế mình thấy rằng Galaxy S22 không có sự thay đổi quá nhiều khi so với thế hệ S21, tuy nhiên theo cá nhân mình S22 đã được tối ưu và gọn gàng hơn thế hệ trước. Màn hình 6.1 inch cực kỳ nhỏ gọn, độ phân giải Full HD+ cùng tấm nền Dynamic AMOLED 2X cho khả năng hiển thị vô cùng chi tiết, màu đen sâu, màu sắc hài hòa, hỗ trợ dải màu rộng DCI-P3 giúp cho chúng ta có trải nghiệm sử dụng làm việc, giải trí một cách sinh động hơn. Với tần số quét 120 Hz máy cho trải nghiệm vuốt chạm cực kì mượt mà, hiệu ứng chuyển cảnh hay hiệu ứng khi mở ứng dụng rất là trơn tru và hầu như không có hiện tượng khựng. Galaxy S22 có độ sáng tối đa đến 1300 nits cho hiển thị nội dung tốt cho dù bạn xem ở ngoài trời nắng chói. Chế độ bảo vệ mắt được trang bị giúp đôi mắt hạn chế tiếp xúc với ánh sáng xanh cho quá trình sử dụng điện thoại của bạn trở nên thoải mái hơn. Bên cạnh đó, cảm biến vân tay cũng được Samsung tích hợp trong màn hình với tốc độ nhận diện nhanh, giúp dữ liệu của bạn luôn an toàn và tiện lợi hơn trong quá trình sử dụng.",
      "feature": "Cảm giác đầu tiên Samsung Galaxy S22 mang lại cho mình khi sử dụng là máy cho cảm giác cầm nắm cực kỳ chắc chắn và đằm tay với thiết kế nhỏ gọn của mình. Đây là một chiếc điện thoại vô cùng bền bỉ khi khung viền được cấu thành từ Armor Aluminum cứng cáp, được trang bị kính cường lực Corning Gorilla Glass Victus+ đầu tiên trên thị trường. Mặt lưng cũng được hoàn thiện từ kính với thiết kế phẳng, viền màn hình của Galaxy S22 được làm mỏng ở cả 4 cạnh trông rất cân đối và gọn gàng. Tất cả những điều trên tạo nên một cảm giác cầm nắm, sử dụng rất tốt.",
      "id": 5
    },
    {
      "name": "Điện thoại Samsung Galaxy S22 Ultra 5G 128GB ",
      "image": "https://res.cloudinary.com/ductham087/image/upload/v1659983324/03628bffb97e5525ebe30b892ea04fc1_zaniox.jpg",
      "price": 1500000,
      "price_sale": 1300000,
      "categoryId": 1,
      "desc_sort": "Galaxy S22 Ultra 5G chiếc smartphone cao cấp nhất trong bộ 3 Galaxy S22 series mà Samsung đã cho ra mắt. Tích hợp bút S Pen hoàn hảo trong thân máy, trang bị vi xử lý mạnh mẽ cho các tác vụ sử dụng vô cùng mượt mà và nổi bật hơn với cụm camera không viền độc đáo mang đậm dấu ấn riêng.",
      "desc_products": "Galaxy S22 Ultra 5G được kế thừa form thiết kế từ những dòng Note trước đây của hãng đem đến cho bạn có cảm giác vừa mới lạ vừa hoài niệm. Trọng lượng của máy 228 g cho cảm giác cầm nắm đầm tay, khi cầm máy trần thì hơi có cảm giác dễ trượt. Phần mặt lưng điện thoại được làm nhám nên hạn chế tốt việc bám dấu vân tay, có thiết kế cũng khá đơn giản nhưng vẫn toát lên vẻ sang trọng và cao cấp của chiếc máy. Cụm camera sau trên Galaxy S22 Ultra 5G được thiết kế trần tạo cảm giác gọn gàng và cũng tạo nên một điểm nhấn độc đáo cho chiếc máy. Có thể nói Galaxy S22 Ultra 5G chính là chiếc máy đầu tiên được tích hợp bút S Pen hoàn hảo trong một thân máy của dòng Galaxy S. Giờ đây, bạn có thể dễ dàng phác thảo, ghi chú lại những ý tưởng vô cùng nhanh chóng với độ trễ đã được cải thiện cho cảm giác viết vẽ vô cùng chân thật. Hiệu năng trên Galaxy S22 Ultra 5G là điều khỏi bàn cãi khi máy sử dụng chip Snapdragon 8 Gen 1 vô cùng mạnh mẽ với tiến trình sản xuất 4 nm. Khi máy chơi game cũng chỉ ấm lên một chút ở vị trí cụm camera chứ không hoàn toàn quá nóng như những sản phẩm khác khi dùng cùng con chip này. Máy dễ dàng vượt qua được các tựa game Liên Quân, PUBG Mobile, cài đặt cấu hình tối đa thì biểu đồ FPS trên Galaxy S22 Ultra 5G vẫn khá ổn định, không bị drop quá nhiều. Kể cả tựa game Genshin Impact ở mức đồ họa mặc định thì máy chơi vẫn mượt mà, đồ họa hiển thị đẹp mắt. Còn nói về các tác vụ cơ bản như lướt web, đọc báo, xem YouTube,... thì máy hoàn thành một cách dễ dàng, sử dụng mượt mà, khả năng đa nhiệm thoải mái với RAM 8 GB. Máy trang bị 4 camera với camera chính lên đến 108 MP, camera góc siêu rộng 12 MP, 2 camera tele 10 MP hỗ trợ thu phóng quang học 10x.",
      "feature": "Galaxy S22 Ultra 5G được kế thừa form thiết kế từ những dòng Note trước đây của hãng đem đến cho bạn có cảm giác vừa mới lạ vừa hoài niệm. Trọng lượng của máy 228 g cho cảm giác cầm nắm đầm tay, khi cầm máy trần thì hơi có cảm giác dễ trượt. Phần mặt lưng điện thoại được làm nhám nên hạn chế tốt việc bám dấu vân tay, có thiết kế cũng khá đơn giản nhưng vẫn toát lên vẻ sang trọng và cao cấp của chiếc máy.",
      "id": 6
    },
    {
      "name": "Điện thoại Samsung Galaxy Note 10+ 5G ",
      "image": "https://res.cloudinary.com/ductham087/image/upload/v1659983582/samsung-galaxy-note-10-5g-cu-gia-re-xach-tay-uy-tin-minmobile.net_o4l6gy.png",
      "price": "1500000",
      "price_sale": "1300000",
      "categoryId": 1,
      "desc_sort": "Samsung Galaxy Note 10+ 5G là phiên bản Galaxy Note 10 cao cấp nhất vừa được Samsung giới thiệu với trang bị 5G tiên tiến cùng nhiều nâng cấp so với hệ thệ Galaxy Note 9 cũ.",
      "desc_products": "Samsung Galaxy Note 10+ 5G có màn hình với kích thước lên tới 6.8 inch, là một trong những chiếc smartphone có kích thước màn hình lớn nhất trên thị trường hiện nay. Chiếc smartphone này sử dụng màn hình công nghệ Dynamic AMOLED theo cách gọi của Samsung, hỗ trợ HDR10, có chế độ giảm ánh sáng xanh nhưng không làm ảnh hưởng tới trải nghiệm màu sắc của người dùng. Phần viền màn hình của máy được làm mỏng đi rất nhiều so với phiên bản cũ nên mang lại cho người dùng một trải nghiệm màn hình thực sự ấn tượng. Samsung Galaxy Note 10+ 5G cũng sở hữu màn hình độ phân giải cao hơn so với phiên bản Note 10 thường với 1440 x 3040 pixels cho hình ảnh hiển thị chi tiết hơn. 5G là công nghệ của tương lai và việc bạn sở hữu một chiếc máy hỗ trợ công nghệ mạng mới này sẽ giúp bạn có thể năm bắt và trải nghiệm sớm tốc độ kết nối nhanh chóng của mạng này. Samsung Galaxy Note 10+ 5G là một trong những chiếc máy hiếm hoi trên thị trường hiện nay tích hợp sẵn mạng 5G khi bán ra. Nếu bạn là một người yêu thích công nghệ và muốn khám phá những cái mới mẻ thì chiếc Samsung Galaxy Note 10+ 5G chắc chắn sẽ khiến bạn phải suy nghĩ. Bút là đặc trưng làm nên tên tuổi của Note và ở phiên bản Note 10+, cây bút này được cải tiến cả về ngoại hình lẫn các chức năng. Bút S Pen giờ đây cũng được bổ sung nhiều tính năng mới, không chỉ bấm nút để điều khiển như trước nữa, giờ đây bạn cũng có thể vẽ lên không khí để điều khiến Note 10+ qua S Pen. Ví dụ bạn có thể đưa S Pen qua lại trước màn hình của Note 10+ để chuyển qua lại giữa các chế độ chụp hình, vuốt S Pen lên xuống để chuyển đổi nhanh giữa các camera,...",
      "feature": "Samsung Galaxy Note 10+ 5G có màn hình với kích thước lên tới 6.8 inch, là một trong những chiếc smartphone có kích thước màn hình lớn nhất trên thị trường hiện nay. Chiếc smartphone này sử dụng màn hình công nghệ Dynamic AMOLED theo cách gọi của Samsung, hỗ trợ HDR10, có chế độ giảm ánh sáng xanh nhưng không làm ảnh hưởng tới trải nghiệm màu sắc của người dùng.",
      "id": 7
    }
  ],
  "categories": [
    {
      "id": 1,
      "name": "Điện thoại"
    },
    {
      "id": 2,
      "name": "Laptop"
    },
    {
      "id": 3,
      "name": "Đồng hồ thông minh"
    },
    {
      "id": 4,
      "name": "Thiết bị âm thanh"
    },
    {
      "id": 5,
      "name": "Phụ kiện"
    }
  ],
  "accessory": [
    {
      "id": 1,
      "name": "Tai nghe",
      "image": "https://res.cloudinary.com/ductham087/image/upload/v1659973340/airpods_2_0_1d3becd49edd4233816cf27ff271dd0b_admksu.webp"
    },
    {
      "id": 2,
      "name": "Kính cường lực",
      "image": "https://res.cloudinary.com/ductham087/image/upload/v1659979109/f6ba161672f96ff5b81cc2e84464ca5a_hg5plw.jpg"
    },
    {
      "id": 3,
      "name": "Ốp điện thoại",
      "image": "https://res.cloudinary.com/ductham087/image/upload/v1659979234/op-lung-magsafe-iphone-13-pro-max-nhua-deo-apple-mm2u3-290722-011202-600x600_r4thcw.jpg"
    },
    {
      "id": 4,
      "name": "Cáp xạc",
      "image": "https://res.cloudinary.com/ductham087/image/upload/v1659979279/UcTf3JzfiFIr2l0iuRNJ_simg_d0daf0_800x1200_max_lgq0lt.jpg"
    },
    {
      "id": 5,
      "name": "Pin dự phòng",
      "image": "https://res.cloudinary.com/ductham087/image/upload/v1659979330/pin-sac-du-phong-nhanh-25w-samsung-10000mah-chinh-hang_lm0mhr.jpg"
    },
    {
      "id": 6,
      "name": "Camera",
      "image": "https://res.cloudinary.com/ductham087/image/upload/v1659979393/download_epdfll.jpg"
    },
    {
      "id": 7,
      "name": "Đồng hồ",
      "image": "https://res.cloudinary.com/ductham087/image/upload/v1659979437/636778799310641475_00509082-1_rpt3sy.jpg"
    },
    {
      "id": 8,
      "name": "Ổ cứng di động",
      "image": "https://res.cloudinary.com/ductham087/image/upload/v1659979489/orico-4_ly8tgy.jpg"
    },
    {
      "id": 9,
      "name": "Thẻ nhớ",
      "image": "https://res.cloudinary.com/ductham087/image/upload/v1659979529/micro-sandisk-ultra-533x-64gb-02-5e6812af-8e62-4259-9308-ca13303ebb45_l1rekb.webp"
    }
  ],
  "access_pc": [
    {
      "id": 1,
      "name": "Nguồn máy tính",
      "image": "https://res.cloudinary.com/ductham087/image/upload/v1659979800/ob_91f0e1_bo-nguon-may-tinh_crbd3p.png"
    },
    {
      "id": 2,
      "name": "Card màn hình",
      "image": "https://res.cloudinary.com/ductham087/image/upload/v1659979850/Card-m%C3%A0n-h%C3%ACnh-Asus-ROG-Strix-GTX-1650-4GB-GDDR5-1_a9dynv.jpg"
    },
    {
      "id": 3,
      "name": "Mainboard",
      "image": "https://res.cloudinary.com/ductham087/image/upload/v1659979896/39550_1000_ldsszh.png"
    },
    {
      "id": 4,
      "name": "Case",
      "image": "https://res.cloudinary.com/ductham087/image/upload/v1659973956/G03_m0zwg3.jpg"
    },
    {
      "id": 5,
      "name": "Tản nhiệt",
      "image": "https://res.cloudinary.com/ductham087/image/upload/v1659979955/b8db4cacc32faf0bf75806b8732f3e4d_wwm079.jpg"
    },
    {
      "id": 6,
      "name": "Webcam",
      "image": "https://res.cloudinary.com/ductham087/image/upload/v1659979996/c47a62cebc6a6f9a694711e6bdc012c1_hgllxm.jpg"
    },
    {
      "id": 7,
      "name": "SSD",
      "image": "https://res.cloudinary.com/ductham087/image/upload/v1659980058/download_1_qz7nq7.jpg"
    },
    {
      "id": 8,
      "name": "Ổ cứng di động",
      "image": "https://res.cloudinary.com/ductham087/image/upload/v1659979489/orico-4_ly8tgy.jpg"
    },
    {
      "id": 9,
      "name": "Ram",
      "image": "https://res.cloudinary.com/ductham087/image/upload/v1659980125/94a739d9cb92ae18ebda4c4d1f3869ed_w5s2sh.jpg"
    }
  ],
  "users": [
    {
      "email": "ductham784@gmail.com",
      "password": "$2a$10$AeLqE5nS/goW79AjgYSFl.2QLNIVyW0McmDIOqk4wYsmQYF6Yc3yq",
      "phone_number": "0967550071",
      "id": 1,
      "role": 0
    },
    {
      "email": "ductham087@gmail.com",
      "password": "$2a$10$eyvT1du4iHar3N1xb7qGv.ItBu0sOdh0ri4xkuxw8DFbiZOVwupee",
      "phone_number": "0967550071",
      "role": 1,
      "id": 2
    }
  ]
}